package com.example.lesson1;

public class HomeWork {
    /**
     * Нужно создать несколько классов животных:
     * 1. Пес
     * 2. Кошка
     * 3. придумать еще парочку
     *
     * Каждое животное имеет:
     * 1. Имя
     * 2. возраст
     * 3. придумать еще какие-то параметры
     *
     * Каждое животное может:
     * 1. Подать голос
     * 2. Питаться (съедает какое-то количество еды)
     * 3. Двигаться
     * 4.  все, что сумеете придумать
     *
     * Нужно выделить базовый тип с общими атрибутами, инкапсулировать то, что является внутренними.
     * Создать массив с животными и в цикле заставить их поесть и заставить подать голос.
     */
}
