package org.example.HomeWork1;

public class HomeWork {
    /**
     * Нужно создать несколько классов животных:
     * 1. Собака
     * 2. Кот
     * 3. ... Придумать еще несколько
     *
     * Каждое животное имеет: (Поля)
     * 1. имя,
     * 2. возраст,
     * Каждое животное может: (Методы)
     * 1. Подавать голос
     * 2. Питаться
     * 3. Двигаться
     * 4. ... все, что сумеете придумать
     *
     * Нужно выделить базовый тип с общими атрибутами,
     * инкапсулировать то, что является внутренними, внутрь класса.
     * Создать массив с животными и в цикле заставить поесть и издать голос
     * Тоесть чтоб в консоли выводилось кот мяукнул или собака гавкнул
     */
    public static void main(String[] args) {

    }
}
